In [5]:
import pandas as pd

# Create two dataframes
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'value2': [4, 5, 6]})

In [6]:
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [7]:
df2

  key  value2
0   B       4
1   C       5
2   D       6

In [8]:
# Inner join on the 'key' column
pd.merge(df1, df2, on='key')

  key  value1  value2
0   B       2       4
1   C       3       5

In [9]:
# left join
pd.merge(df1, df2, on='key', how='left')

  key  value1  value2
0   A       1     NaN
1   B       2     4.0
2   C       3     5.0

In [10]:
# right join
pd.merge(df1, df2, on='key', how='right')

  key  value1  value2
0   B     2.0       4
1   C     3.0       5
2   D     NaN       6

In [11]:
# outer join
pd.merge(df1, df2, on='key', how='outer')

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     4.0
2   C     3.0     5.0
3   D     NaN     6.0

# try using concat method

In [13]:
# joined based on default index
pd.concat([df1, df2], axis=1)

  key  value1 key  value2
0   A       1   B       4
1   B       2   C       5
2   C       3   D       6

In [15]:
# union default axis is 0
pd.concat([df1, df2])

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     NaN
2   C     3.0     NaN
0   B     NaN     4.0
1   C     NaN     5.0
2   D     NaN     6.0